export const quizQuestions = [
  {
    question: "ما هي الوظيفة الأساسية للمعالج (CPU) في الكمبيوتر؟",
    answers: [
      "تخزين البيانات بشكل دائم",
      "ربط جميع أجزاء الكمبيوتر",
      "اتخاذ القرارات والقيام بالعمليات الحسابية",
      "عرض المعلومات للمستخدم",
    ],
    correctAnswer: "اتخاذ القرارات والقيام بالعمليات الحسابية",
  },
  {
    question:
      "أي مكوّن يخزن البيانات التي يستخدمها الكمبيوتر حاليًا بشكل مؤقت؟",
    answers: [
      "القرص الصلب (Hard Disk)",
      "المعالج (CPU)",
      "اللوحة الأم (Motherboard)",
      "الذاكرة العشوائية (RAM)",
    ],
    correctAnswer: "الذاكرة العشوائية (RAM)",
  },
  {
    question: "ما هي الوظيفة الرئيسية للقرص الصلب في الكمبيوتر؟",
    answers: [
      "ربط أجزاء الكمبيوتر المختلفة",
      "تخزين البيانات بشكل دائم",
      "إدارة نظام التشغيل",
      "التحكم في أجهزة الإدخال والإخراج",
    ],
    correctAnswer: "تخزين البيانات بشكل دائم",
  },
  {
    question:
      "أي من التالي يُعتبر 'العمود الفقري' للكمبيوتر ويقوم بربط جميع المكونات الرئيسية؟",
    answers: [
      "اللوحة الأم (Motherboard)",
      "المعالج (CPU)",
      "الذاكرة العشوائية (RAM)",
      "نظام التشغيل",
    ],
    correctAnswer: "اللوحة الأم (Motherboard)",
  },
  {
    question: "ما هو دور نظام التشغيل في الكمبيوتر؟",
    answers: [
      "تخزين جميع ملفات المستخدم",
      "إدارة وتنظيم موارد الكمبيوتر",
      "اتخاذ القرارات وحل المشاكل",
      "توفير وظائف الإدخال والإخراج",
    ],
    correctAnswer: "إدارة وتنظيم موارد الكمبيوتر",
  },
  {
    question: "أي من هذه الأمثلة يُعتبر من أجهزة 'الإدخال' و'الإخراج'؟",
    answers: [
      "المعالج والذاكرة العشوائية",
      "القرص الصلب واللوحة الأم",
      "لوحة المفاتيح والشاشة",
      "البرمجيات والمكونات المادية",
    ],
    correctAnswer: "لوحة المفاتيح والشاشة",
  },
];
